# 파이썬 반복문

# 181번
apart = [['101호', '102호'], ['201호', '202호'], ['301호', '302호']]

# 182번
stock = [['시가', 100, 200, 300], ['종가', 80, 210, 330]]

# 183번
stock = {"시가": [100, 200, 300], "종가": [80, 210, 330]}

# 184번
stock = {"10/10": [80, 110, 70, 90], "10/11": [210, 230, 190, 200]}

# 185번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart:
  for j in i:
    print(j, '호')

# 186번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart[::-1]:
  for j in i:
    print(j, '호')

# 187번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart[::-1]:
  for j in i[::-1]:
    print(j, '호')

# 188번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart:
  for j in i:
    print(j, '호')
    print('-' * 5)

# 189번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart:
  for j in i:
    print(j, '호')
print('-' * 5)

# 190번
apart = [[101, 102], [201, 202], [301, 302]]
for i in apart:
  for j in i:
    print(j, '호')
print('-' * 5)